---
type: InitialColor
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 4
tags: [revit-api, class]
---

# InitialColor

`Autodesk.Revit.DB.Lighting.InitialColor` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Clone | 2013 | `public InitialColor Clone ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | TemperatureValue | 2013 | `public double TemperatureValue { get ; }` |